In [1]:
import pandas as pd

In [4]:
df=pd.read_csv(r'Weather Data in India from 1901 to 2017.csv')
df

,Unnamed: 0,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC
0,0,1901,17.99,19.43,23.49,26.41,28.28,28.60,27.49,26.98,26.26,25.08,21.73,18.95
1,1,1902,19.00,20.39,24.10,26.54,28.68,28.44,27.29,27.05,25.95,24.37,21.33,18.78
2,2,1903,18.32,19.79,22.46,26.03,27.93,28.41,28.04,26.63,26.34,24.57,20.96,18.29
3,3,1904,17.77,19.39,22.95,26.73,27.83,27.85,26.84,26.73,25.84,24.36,21.07,18.84
4,4,1905,17.40,17.79,21.78,24.84,28.32,28.69,27.67,27.47,26.29,26.16,22.07,18.71
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
112,112,2013,18.88,21.07,24.53,26.97,29.06,28.24,27.50,27.22,26.87,25.63,22.18,19.69
113,113,2014,18.81,20.35,23.34,26.91,28.45,29.42,28.07,27.42,26.61,25.38,22.53,19.50
114,114,2015,19.02,21.23,23.52,26.52,28.82,28.15,28.03,27.64,27.04,25.82,22.95,20.21
115,115,2016,20.92,23.58,26.61,29.56,30.41,29.70,28.18,28.17,27.72,26.81,23.90,21.89
116,116,2017,20.59,23.08,25.58,29.17,30.47,29.44,28.31,28.12,28.11,27.24,23.92,21.47

# ANALYZE DATA FRAMES

In [6]:
df.head()

,Unnamed: 0,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC
0,0,1901,17.99,19.43,23.49,26.41,28.28,28.60,27.49,26.98,26.26,25.08,21.73,18.95
1,1,1902,19.00,20.39,24.10,26.54,28.68,28.44,27.29,27.05,25.95,24.37,21.33,18.78
2,2,1903,18.32,19.79,22.46,26.03,27.93,28.41,28.04,26.63,26.34,24.57,20.96,18.29
3,3,1904,17.77,19.39,22.95,26.73,27.83,27.85,26.84,26.73,25.84,24.36,21.07,18.84
4,4,1905,17.40,17.79,21.78,24.84,28.32,28.69,27.67,27.47,26.29,26.16,22.07,18.71

In [7]:
df.shape

(117, 14)

In [8]:
df.index

RangeIndex(start=0, stop=117, step=1)

In [9]:
df.columns

Index(['Unnamed: 0', 'YEAR', 'JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN', 'JUL',
       'AUG', 'SEP', 'OCT', 'NOV', 'DEC'],
      dtype='object')

In [10]:
df.dtypes

Unnamed: 0      int64
YEAR            int64
JAN           float64
FEB           float64
MAR           float64
APR           float64
MAY           float64
JUN           float64
JUL           float64
AUG           float64
SEP           float64
OCT           float64
NOV           float64
DEC           float64
dtype: object

In [14]:
df['JAN'].unique()

array([17.99, 19.  , 18.32, 17.77, 17.4 , 17.5 , 19.27, 18.35, 17.79,
       18.14, 18.52, 18.6 , 18.2 , 18.96, 17.93, 18.16, 17.25, 18.78,
       18.27, 18.61, 18.3 , 18.23, 18.06, 17.53, 18.65, 18.15, 18.66,
       18.25, 17.75, 19.34, 18.72, 17.84, 17.8 , 17.54, 18.02, 18.4 ,
       18.1 , 18.33, 18.07, 18.  , 17.33, 18.31, 17.72, 19.01, 18.36,
       19.09, 18.67, 18.11, 18.42, 18.01, 19.5 , 18.39, 18.89, 17.59,
       17.71, 18.47, 18.69, 17.52, 18.12, 18.51, 18.97, 18.81, 18.76,
       18.38, 18.28, 18.24, 18.44, 18.58, 17.68, 18.56, 18.37, 19.33,
       19.18, 19.81, 17.86, 18.84, 18.87, 18.5 , 18.83, 19.07, 19.96,
       19.24, 18.49, 19.79, 19.15, 18.88, 19.02, 20.92, 20.59])

In [15]:
df.nunique()

Unnamed: 0    117
YEAR          117
JAN            89
FEB            92
MAR            93
APR            99
MAY            86
JUN            84
JUL            76
AUG            80
SEP            74
OCT            82
NOV            95
DEC            88
dtype: int64

In [16]:
df.count()

Unnamed: 0    117
YEAR          117
JAN           117
FEB           117
MAR           117
APR           117
MAY           117
JUN           117
JUL           117
AUG           117
SEP           117
OCT           117
NOV           117
DEC           117
dtype: int64

In [17]:
df['JAN'].value_counts()

JAN
18.32    4
18.40    3
18.25    3
18.20    3
18.15    3
        ..
18.01    1
19.50    1
18.39    1
18.16    1
20.59    1
Name: count, Length: 89, dtype: int64

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 117 entries, 0 to 116
Data columns (total 14 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  117 non-null    int64
 1   YEAR        117 non-null    int64
 2   JAN         117 non-null    float64
 3   FEB         117 non-null    float64
 4   MAR         117 non-null    float64
 5   APR         117 non-null    float64
 6   MAY         117 non-null    float64
 7   JUN         117 non-null    float64
 8   JUL         117 non-null    float64
 9   AUG         117 non-null    float64
 10  SEP         117 non-null    float64
 11  OCT         117 non-null    float64
 12  NOV         117 non-null    float64
 13  DEC         117 non-null    float64
dtypes: float64(12), int64(2)
memory usage: 12.9 KB

# Find all the unique 'MAR' values in the data ?

In [19]:
df.head(2)

,Unnamed: 0,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC
0,0,1901,17.99,19.43,23.49,26.41,28.28,28.60,27.49,26.98,26.26,25.08,21.73,18.95
1,1,1902,19.00,20.39,24.10,26.54,28.68,28.44,27.29,27.05,25.95,24.37,21.33,18.78

In [20]:
df.nunique()

Unnamed: 0    117
YEAR          117
JAN            89
FEB            92
MAR            93
APR            99
MAY            86
JUN            84
JUL            76
AUG            80
SEP            74
OCT            82
NOV            95
DEC            88
dtype: int64

In [22]:
df['MAR'].nunique()

93

In [26]:
df['MAR'].unique()# Answer

array([23.49, 24.1 , 22.46, 22.95, 21.78, 22.21, 22.03, 22.93, 23.4 ,
       22.9 , 22.05, 22.15, 22.63, 22.69, 24.24, 22.64, 23.15, 23.02,
       24.26, 23.65, 23.21, 24.12, 23.5 , 22.87, 22.71, 23.23, 24.05,
       23.36, 23.31, 23.39, 23.22, 22.97, 22.84, 22.6 , 23.61, 21.98,
       22.23, 23.87, 22.54, 23.28, 23.55, 22.72, 23.37, 22.45, 23.13,
       22.73, 24.9 , 23.66, 23.93, 23.44, 22.31, 22.65, 23.84, 24.25,
       22.81, 23.51, 23.18, 24.52, 23.29, 23.43, 23.33, 23.91, 22.78,
       22.98, 24.45, 22.75, 23.24, 23.26, 22.37, 22.68, 23.98, 24.6 ,
       23.53, 23.45, 23.  , 22.79, 23.58, 24.14, 25.13, 23.64, 24.18,
       24.44, 23.62, 26.19, 23.52, 24.43, 24.55, 26.53, 24.11, 24.53,
       23.34, 26.61, 25.58])

# find out all the null values in the data ?

In [28]:
df.isnull().sum()

Unnamed: 0    0
YEAR          0
JAN           0
FEB           0
MAR           0
APR           0
MAY           0
JUN           0
JUL           0
AUG           0
SEP           0
OCT           0
NOV           0
DEC           0
dtype: int64

In [29]:
df.notnull().sum()

Unnamed: 0    117
YEAR          117
JAN           117
FEB           117
MAR           117
APR           117
MAY           117
JUN           117
JUL           117
AUG           117
SEP           117
OCT           117
NOV           117
DEC           117
dtype: int64

# rename the column name 'YEAR'of the dataframe to YEAR COUNT' ?

In [32]:
df.head(2)

,Unnamed: 0,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC
0,0,1901,17.99,19.43,23.49,26.41,28.28,28.60,27.49,26.98,26.26,25.08,21.73,18.95
1,1,1902,19.00,20.39,24.10,26.54,28.68,28.44,27.29,27.05,25.95,24.37,21.33,18.78

In [40]:
df.rename(columns = {'YEAR':'YEAR COUNT'})

,Unnamed: 0,YEAR COUNT,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC
0,0,1901,17.99,19.43,23.49,26.41,28.28,28.60,27.49,26.98,26.26,25.08,21.73,18.95
1,1,1902,19.00,20.39,24.10,26.54,28.68,28.44,27.29,27.05,25.95,24.37,21.33,18.78
2,2,1903,18.32,19.79,22.46,26.03,27.93,28.41,28.04,26.63,26.34,24.57,20.96,18.29
3,3,1904,17.77,19.39,22.95,26.73,27.83,27.85,26.84,26.73,25.84,24.36,21.07,18.84
4,4,1905,17.40,17.79,21.78,24.84,28.32,28.69,27.67,27.47,26.29,26.16,22.07,18.71
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
112,112,2013,18.88,21.07,24.53,26.97,29.06,28.24,27.50,27.22,26.87,25.63,22.18,19.69
113,113,2014,18.81,20.35,23.34,26.91,28.45,29.42,28.07,27.42,26.61,25.38,22.53,19.50
114,114,2015,19.02,21.23,23.52,26.52,28.82,28.15,28.03,27.64,27.04,25.82,22.95,20.21
115,115,2016,20.92,23.58,26.61,29.56,30.41,29.70,28.18,28.17,27.72,26.81,23.90,21.89
116,116,2017,20.59,23.08,25.58,29.17,30.47,29.44,28.31,28.12,28.11,27.24,23.92,21.47

In [39]:
df.head(2)

,Unnamed: 0,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC
0,0,1901,17.99,19.43,23.49,26.41,28.28,28.60,27.49,26.98,26.26,25.08,21.73,18.95
1,1,1902,19.00,20.39,24.10,26.54,28.68,28.44,27.29,27.05,25.95,24.37,21.33,18.78

# what is the mean 'oct'?

In [41]:
df.head(2)

,Unnamed: 0,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC
0,0,1901,17.99,19.43,23.49,26.41,28.28,28.60,27.49,26.98,26.26,25.08,21.73,18.95
1,1,1902,19.00,20.39,24.10,26.54,28.68,28.44,27.29,27.05,25.95,24.37,21.33,18.78

In [42]:
df.OCT.mean()

24.742051282051282

# what is the standard deviation of 'MAR' in this data

In [43]:
df.MAR.std()

0.8628253902114356

# what is the variance of 'MAR' in this data

In [45]:
df['MAR'].var()

0.744467653993516